Repository: xoliq0v/eco_sfera
Catalog: lib/core/assets/l10n/app_*.arb
Languages: uz

# boardingDescription
source: PPP enterprise for the implementation of works related to waste
uz: Chiqindilar bilan bog’liq ishlarni amalga oshirish bo’yicha DXSh korxonasi

# continueBoarding
source: Continue
uz: Davom etish

# chooseLang
source: Choose language
uz: Tilni tanlang

source: Welcome!
uz: Xush kelibsiz!

source: Login
uz: Tizimga kirish

source: Password
uz: Parol

source: Enter
uz: Kirish

# error
source: Invalid login
uz: Noto’g’ri login

source: Password cannot be empty
uz: Parol bo'sh bo'lishi mumkin emas

source: Password must be at least 8 characters long
uz: Parol kamida 8 ta belgidan iborat bo'lishi kerak

source: Password must contain at least one uppercase letter
uz: Parol kamida bitta katta harfdan iborat bo'lishi kerak

source: Password must contain at least one lowercase letter
uz: Parol kamida bitta kichik harfdan iborat bo'lishi kerak

source: Password must contain at least one number
uz: Parol kamida bitta raqamni o'z ichiga olishi kerak

source: Password must contain at least one special character
uz: Parol kamida bitta maxsus belgi bo'lishi kerak

source: Password cannot contain spaces
uz: Parol joylarida bo'sh joy bo'lolmaydi

source: Username cannot be empty
uz: Foydalanuvchi ismi bo'sh bo'lishi mumkin emas

source: Username cannot have leading or trailing spaces
uz: Foydalanuvchi nomi etakchi yoki orqa joylarga ega bo'lolmaydi

source: Username must be between 3 and 30 characters
uz: Foydalanuvchi nomi 3 dan 30 gacha belgilar bo'lishi kerak

source: Username can only contain letters, numbers, periods, and underscores
uz: Foydalanuvchi nomi faqat harflar, raqamlar, davrlar va pastki chiziqlarda bo'lishi mumkin

source: Waste
uz: Chiqindi

source: Secondary
uz: вторичный

source: Total balance
uz: Umumiy balans

source: Orders
uz: Buyurtmalar

source: From where
uz: Qayerdan

source: Acceptance
uz: Qabul qilish
